Autodesk.Revit.DB.ViewSet
A set that contains views.

Autodesk.Revit.DB.ViewSet.Insert(Autodesk.Revit.DB.View)
System.Int32
Insert the specified view into the set.
item: The view to be inserted into the set.
Returns: Returns whether the view was inserted into the set.

Autodesk.Revit.DB.ViewSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ViewSet.ReverseIterator
Autodesk.Revit.DB.ViewSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.ViewSet.ForwardIterator
Autodesk.Revit.DB.ViewSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ViewSet.Erase(Autodesk.Revit.DB.View)
System.Int32
Removes a specified view from the set.
item: The view to be erased.
Returns: The number of views that were erased from the set.

Autodesk.Revit.DB.ViewSet.Contains(Autodesk.Revit.DB.View)
System.Boolean
Tests for the existence of a view within the set.
item: The view to be searched for.
Returns: The Contains method returns True if the view is within the set, otherwise False.

Autodesk.Revit.DB.ViewSet.Clear
void
Removes every view from the set, rendering it empty.

Autodesk.Revit.DB.ViewSet.Size
System.Int32
get
Returns the number of views that are in the set.

Autodesk.Revit.DB.ViewSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.